tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
cask "osxfuse"
brew "bat"
brew "coreutils"
brew "ffmpeg"
brew "firebase-cli"
brew "git-delta"
brew "graphviz"
brew "grep"
brew "imagemagick"
brew "jq"
brew "mas"
brew "nkf"
brew "nvm"
brew "openjdk"
brew "optipng"
brew "pandoc"
brew "peco"
brew "poppler"
brew "rename"
brew "ruby"
brew "sshfs"
brew "tidy-html5"
brew "tree"
brew "watch"
brew "wget"
brew "youtube-dl"
cask "1password"
cask "alt-tab"
cask "android-platform-tools"
cask "barrier"
cask "calibre"
cask "discord"
cask "docker"
cask "dropbox"
cask "font-inconsolata-for-powerline"
cask "font-source-han-sans"
cask "google-chrome"
cask "google-cloud-sdk"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "microsoft-teams"
cask "processing"
cask "rectangle"
cask "sneek"
cask "spotify"
cask "the-unarchiver"
cask "touchdesigner"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "vysor"
cask "zoom"
mas "GarageBand", id: 682658836
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Slack", id: 803453959
mas "Toggl Track", id: 957734279
mas "VMware Remote Console", id: 1230249825
